{
    "head": "Часто задаваемые вопросы",
    "language": "ru",
    "tail": "",
    "title": "ЧаВо FLibrary",
    "x": [
        {
            "q": "Чем эта раздача отличается от оригинальных?",
            "t": [
                "Прежде всего, чем эта раздача не отличается - набором книг. Вероятность того, что здесь книги нет, а в \"оригинальных\" раздачах есть - минимальна. Если вы нашли такую книгу - это ЧП, пожалуйста, свяжитесь со мной.",
                "Теперь про отличия.",
                "Главное отличие - размер. Ради него эта раздача и существует.",
                "Дополнительные плюшки:",
                "<ul>",
                "<li>Починены книги с нарушениями xml-структуры.</li>",
                "<li>Починены или удалены битые иллюстрации.</li>",
                "<li>Устранены столь раздражающие многих дубли (не все, конечно)</li>",
                "<li>А ещё тут есть комментарии читателей с сайта Флибусты и краткая информация о некоторых авторах.</li>",
                "<li>Кроме того, здесь раздаётся каталогизатор FLibrary, он лучше, лучше <s>собаки</s> MyHomeLib.</li>",
                "</ul>",
                ""
            ],
            "v": false,
            "x": [
                {
                    "q": "Почему различается количество книг?",
                    "t": [
                        "<ul>",
                        "<li>Удалены дубли</li>",
                        "<li>Выброшены файлы нулевого размера</li>",
                        "<li>Выброшены файлы, оборванные посередине</li>",
                        "<li>Добавлены неиндексированные файлы, т.е. такие, что в архивах есть, а в дампах Флибусты/Либрусека - нет</li>",
                        "</ul>",
                        ""
                    ],
                    "v": false
                },
                {
                    "q": "А почему тогда эта раздача настолько меньше по размеру?",
                    "t": [
                        "Уменьшение размера достигнуто так:",
                        "<ul>",
                        "<li>Текст книг и иллюстрации хранятся раздельно.</li>",
                        "<li>Тексты пережаты в 7z, что значительно эффективнее, чем zip.</li>",
                        "<li>Картинки перекодированы в JPEG XL, который эффективнее JPEG и PNG.</li>",
                        "<li>Отзывы и информация об авторах невелики по объёму, ~1Гб.</li>",
                        "<li>Удалённые дубли тоже дают свои 5% экономии</li>",
                        "<li>Удалены битые и не поддающиеся починке картинки, но это совсем копейки</li>",
                        "</ul>",
                        "Бонус - картинки, отзывы и инфу про авторов можно вообще не скачивать, тогда размер ещё <b>втрое</b> меньше.",
                        ""
                    ],
                    "v": false
                }
            ]
        },
        {
            "q": "Как будет обновляться раздача?",
            "t": [
                "Буду стараться обновлять раздачу в начале месяца.",
                "Обновления содержат:",
                "<ul>",
                "<li>Пара новых 7z-архивов с книгами в формате fb2, без картинок</li>",
                "<li>4 новых zip-архива с картинками: обложки и иллюстрации</li>",
                "<li>Обновление индексного файла *.inpx</li>",
                "<li>Замена дистрибов FLibrary на актуальные, если случился релиз</li>",
                "<li>Обновление последнего архива с отзывами читателей + новый (месячный) архив с отзывами читателей</li>",
                "<li>Обновление последнего архива с информацией об авторах + новый архив, если накопилось достаточно новых записей об авторах</li>",
                "</ul>",
                "Таким образом, каждое месячное обновление должно по минимуму затрагивать ранее загруженные файлы.",
                "<br><p>",
                "К сожалению, такой подход неидеален для отзывов читателей и информации об авторах из-за регулярной правки старых записей на сайте. Поэтому иногда эти файлы будут перевыкладываться оптом, по мере накопления правок в старых записях. Или по чисто техническим причинам.",
                "<br><p>",
                ""
            ],
            "v": true,
            "x": [
                {
                    "q": "Так же как \"оригинальные\", в режиме добавления новых архивов",
                    "t": [
                        "<br><b>(⊙_⊙) Внимание!</b> Раздача ведётся путём добавления новых архивов; при каждом добавлении создаётся новый торрент. Чтобы начать докачку нового архива, пользователям необходимо сделать следующее:",
                        "<ol>",
                        "<li>Остановить скачивание.</li>",
                        "<li>Удалить старый торрент у себя из клиента, но без удаления файлов раздачи.</li>",
                        "<li>Скачать новый торрент и запустить его у себя в клиенте вместо старого, при этом указать клиенту путь в старую папку куда и должно происходить скачивание новых архивов.</li>",
                        "</ol>",
                        "Ваш клиент при этом должен произвести хеширование (проверку) старой папки (если не производит сам - помогите ему сделать это). В результате он будет докачивать только те архивы, которых у Вас ещё нет. Старые архивы при этом не удаляются, а продолжают раздаваться!<br>",
                        "<br><p>",
                        "Eсли Вы уже удалили старые архивы, то предотвратить их повторную закачку можно, сняв галочки в соответствующих местах при запуске нового торрента. По возможности, желательно не удалять старые архивы как можно дольше. Так вы поможете другим людям скачать раздачу быстрее.<br>",
                        ""
                    ],
                    "v": false
                }
            ]
        }
    ]
}
