{
    "language": "ru",
    "macro": {
        "#HEAD#": "Часто задаваемые вопросы",
        "#LANGUAGE#": "ru",
        "#OTHERLANGUAGE1#": "en",
        "#OTHERLANGUAGE2#": "uk",
        "#STYLE#": "Стиль",
        "#TAIL#": "Дизайн © <a href=\"https://github.com/Jurchos\">Юрий Шатров ака Jurchos</a>",
        "#TITLE#": "FLibrary ЧаВо"
    },
    "x": [
        {
            "q": "Чем эта раздача отличается от оригинальных?",
            "t": [
                "Прежде всего, чем эта раздача не отличается - набором книг. Вероятность того, что здесь книги нет, а в \"оригинальных\" раздачах есть - минимальна. Если вы нашли такую книгу - это ЧП, пожалуйста, свяжитесь со мной.",
                "Теперь про отличия.",
                "Главное отличие - размер. Ради него эта раздача и существует.",
                "Дополнительные плюшки:",
                "Починены книги с нарушениями xml-структуры.",
                "Починены или удалены битые иллюстрации.",
                "Устранены столь раздражающие многих дубли (не все, конечно)",
                "А ещё тут есть комментарии читателей с сайта Флибусты и краткая информация о некоторых авторах.",
                "Кроме того, здесь раздаётся каталогизатор FLibrary, он лучше, лучше <s>собаки</s> MyHomeLib."
            ],
            "x": [
                {
                    "q": "Почему различается количество книг?",
                    "t": [
                        "Удалены дубли",
                        "Выброшены файлы нулевого размера",
                        "Выброшены файлы, оборванные посередине",
                        "Добавлены неиндексированные файлы, т.е. такие, что в архивах есть, а в дампах Флибусты/Либрусека - нет"
                    ]
                },
                {
                    "q": "А почему тогда эта раздача настолько меньше по размеру?",
                    "t": [
                        "Уменьшение размера достигнуто так:",
                        "Текст книг и иллюстрации хранятся раздельно.",
                        "Тексты пережаты в 7z, что значительно эффективнее, чем zip.",
                        "Картинки перекодированы в JPEG XL, который эффективнее JPEG и PNG.",
                        "Отзывы и информация об авторах невелики по объёму, ~1Гб.",
                        "Удалённые дубли тоже дают свои 5% экономии",
                        "Удалены битые и не поддающиеся починке картинки, но это совсем копейки",
                        "Бонус - картинки, отзывы и инфу про авторов можно вообще не скачивать, тогда размер ещё <b>втрое</b> меньше."
                    ]
                }
            ]
        },
        {
            "q": "Как будет обновляться раздача?",
            "t": [
                "Буду стараться обновлять раздачу в начале месяца.",
                "Обновления содержат:",
                "Пара новых 7z-архивов с книгами в формате fb2, без картинок",
                "4 новых zip-архива с картинками: обложки и иллюстрации",
                "Обновление индексного файла *.inpx",
                "Замена дистрибов FLibrary на актуальные, если случился релиз",
                "Обновление последнего архива с отзывами читателей + новый (месячный) архив с отзывами читателей",
                "Обновление последнего архива с информацией об авторах + новый архив, если накопилось достаточно новых записей об авторах",
                "Таким образом, каждое месячное обновление должно по минимуму затрагивать ранее загруженные файлы.",
                "К сожалению, такой подход неидеален для отзывов читателей и информации об авторах из-за регулярной правки старых записей на сайте. Поэтому иногда эти файлы будут перевыкладываться оптом, по мере накопления правок в старых записях. Или по чисто техническим причинам."
            ],
            "x": [
                {
                    "q": "Так же как \"оригинальные\", в режиме добавления новых архивов",
                    "t": [
                        "<b>(⊙_⊙) Внимание!</b> Раздача ведётся путём добавления новых архивов; при каждом добавлении создаётся новый торрент. Чтобы начать докачку нового архива, пользователям необходимо сделать следующее:",
                        "Остановить скачивание.",
                        "Удалить старый торрент у себя из клиента, но без удаления файлов раздачи.",
                        "Скачать новый торрент и запустить его у себя в клиенте вместо старого, при этом указать клиенту путь в старую папку куда и должно происходить скачивание новых архивов.",
                        "Ваш клиент при этом должен произвести хеширование (проверку) старой папки (если не производит сам - помогите ему сделать это). В результате он будет докачивать только те архивы, которых у Вас ещё нет. Старые архивы при этом не удаляются, а продолжают раздаваться!",
                        "Eсли Вы уже удалили старые архивы, то предотвратить их повторную закачку можно, сняв галочки в соответствующих местах при запуске нового торрента. По возможности, желательно не удалять старые архивы как можно дольше. Так вы поможете другим людям скачать раздачу быстрее."
                    ],
                    "v": true
                }
            ]
        },
        {
            "q": "Будет ли работать с этой раздачей мой любимый каталогизатор?",
            "t": [
                "Нет, не будет."
            ],
            "x": [
                {
                    "q": "И MyHomeLib не будет?",
                    "t": [
                        "И MyHomeLib не будет.",
                        "По крайней мере, не будет в должной мере. Да, индексный файл *.inpx в раздаче совместим с MHL, то есть создать коллекцию сможете. Но зачем? Из неё не получится экспортировать книги. Да и сама коллекция не будет корректной, MHL не умеет в мультисерийность книг, поэтому наплодит копии книг, входящих в несколько серий. Короче, в морг."
                    ]
                },
                {
                    "q": "А xxxLib для yyyOS?",
                    "t": [
                        "У меня нет ни возможности, ни желания, чтобы проверять все имеющиеся на просторах интернета каталогизаторы на совместимость с придуманным мной форматом хранения. Но почти уверен, что не взлетит. Проверьте сами и сообщите общественности. Результат вашей проверки добавлю сюда, со ссылкой на вас, разумеется."
                    ]
                },
                {
                    "q": "А почему?",
                    "t": [
                        "7z",
                        "Картинки отделены от fb2",
                        "Ну ладно, каталогизаторы с поддержкой 7z-архивов может и будут работать, но с ограничением: извлечённые ими книги будут без картинок."
                    ]
                },
                {
                    "q": "И что делать?",
                    "t": [
                        "Использовать FLibrary"
                    ],
                    "x": [
                        {
                            "q": "Не могу, у меня линукс",
                            "t": [
                                "Использовать wine",
                                "Консольный <a href=\"https://codeberg.org/aku4wb/flbs\" target=\"_blank\">скрипт</a> под линукс / linux, работающий с этой раздачей, от уважаемого razobit"
                            ],
                            "x": [
                                {
                                    "q": "что он умеет",
                                    "t": [
                                        "поиск по автору",
                                        "поиск по названию книги",
                                        "извлечение книги с изображениями в fb2"
                                    ]
                                }
                            ]
                        },
                        {
                            "q": "Не могу, у меня Windows 7",
                            "t": [
                                "Да, тогда действительно не можете. Раздача не для вас, извините."
                            ],
                            "x": [
                                {
                                    "q": "нам пишут",
                                    "t": [
                                        "для пользователей Windows 7/2008R2 <a href=\"https://github.com/YuZhouRen86/VxKex-NEXT\" target=\"_blank\">VxKek</a> - так что использовать на 7 можно! Самое главное, чтобы машина была полностью изолированной от сети или в полностью закрытом сетевом контуре. © HedgehogInTheCPP"
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "q": "Как вернуть в fb2 хранящиеся отдельно обложки и иллюстрации?",
            "t": [
                "Для работы с таким форматом хранения книг в раздаче есть каталогизатор FLibrary. При экспорте книг из коллекции FLibrary возвращает картинки в тело fb2. То же самое при запуске внешней читалки из FLibrary. И при скачивании книги по OPDS. И через web-интерфейсы. Как угодно, если книга извлекается из коллекции при помощи FLibrary, результат будет один - картинки возвращаются в fb2, на свои законные места."
            ]
        },
        {
            "q": "Как добавить новую коллекцию?",
            "t": [
                "Диалог добавления или создания новой коллекции можно вызвать из главного меню программы.",
                "Этот же диалог показывается при первом запуске программы.",
                "В диалоге следует указать:",
                "1. Имя коллекции",
                "2. Путь к файлу с базой данных",
                "3. Путь к папке с архивами книг, там же программа ожидает найти индексный файл *.inpx",
                "13. Путь к индексной файлу *.inpx, если он находится в другой папке, чем архив книг, или если нужно создать коллекцию без архива книг.",
                "Избежать ошибок при заполнении помогут кнопки:",
                "5. Покажет диалог выбора файла базы данных",
                "6. Покажет диалог выбора папки с архивами книг",
                "4. Извлечёт имя из индексного файла коллекции, если найдёт. Чтобы это сработало, надо сначала указать 3 или 13.",
                "Если что-то было заполнено неверно, об этом скажет строка сообщения об ошибке 10.",
                "После правильного заполнения полей 1-3 можно нажать на кнопку 11. Начнётся процесс создания коллекции. Это не займёт много времени, в зависимости от производительности процессора и скорости диска, на котором вы решили расположить базу данных. На моём компе создание новой коллекции - локальной копии Флибусты занимает около полуминуты."
            ],
            "x": [
                {
                    "q": "Детали, нюансы",
                    "t": [
                        "В качестве базы данных можно указать уже имеющийся файл, например, от более ранней версии программы, или вообще от MyHomeLib. Тогда кнопка 11 поменяет текст на \"Добавить\", и вместо создания новой коллекции будет добавлена коллекция из указанного файла. ",
                        "<b>(⊙_⊙) ВНИМАНИЕ!</b> После этого файл базы данных скорее всего не будет пригоден к использованию в той программе, в которой был создан, т.к. FLibrary изменит его структуру под себя.",
                        "Опции создания коллекции:",
                        "7. Добавлять неиндексированные книги, по умолчанию включено. В коллекцию будут добавлены найденные в архивах книги, о которых нет записей в индексе архива. Т.е. в архиве есть, в индексном файле - нет.",
                        "8. Добавлять отсутствующие в архивах книги, по умолчанию выключено. В коллекцию будут добавлены все имеющиеся в индексе книги, даже те, файлов которых нет в архиве. Т.е. симметрично предыдущему, в индексе есть, в архиве может и не быть.",
                        "9. Сканировать неиндексированные архивы, по умолчанию выключено. FLibrary просканирует все архивы в указанной папке, в том числе неупомянутые в индексном файле. Т.е. можно подложить в папку с архивами левые архивы с книгами в формате fb2, и они будут добавлены в коллекцию. Разумеется, такое сканирование займёт больше времени, чем простой разбор *.inpx.",
                        "12. Помечать неиндексированные книги как удаленные, по умолчанию включено. Неиндексированные файлы находятся в архиве по историческим причинам и обычно имеют индексированные копии.",
                        "14. Тип архива. При включенной галке 8 для проиндексированой книги в папке 3 может не оказаться архива. Тогда будет записан архив с именем из индекса и указанным расширением. Такое может понадобиться при поиске нужной книги без скачивания всей раздачи."
                    ]
                }
            ]
        },
        {
            "q": "Как обновить коллекцию?",
            "t": [
                "Докачиваем обновление раздачи как обычно, при следующем запуске FLibrary обнаружит изменение индексного файла *.inpx и предложит обновить коллекцию. Соглашаетесь, и через несколько секунд всё готово. Тем не менее, время от времени имеет смысл пересоздавать коллекцию \"с нуля\", т.к. автоматическое обновление подтягивает только отсутствующие ранее данные. В то время как уже имеющиеся описания могут содержать полезные исправления. Иногда полезно пересоздать коллекцию при обновлении версии FLibrary, особенно если это рекомендуется на странице What's Changed. При пересоздании коллекции не забывайте сохранять пользовательские данные.",
                "Для http-сервера FLibrary есть скрытая настройка <a href=\"#offlink1\">(см. ниже)</a>, побуждающая его молча обновлять коллекцию при изменении *.inpx."
            ]
        },
        {
            "q": "Как найти книгу по названию, автору, серии?",
            "t": [
                "По автору и серии лучше искать в соответствующих разделах навигации, где можно не только искать по списку, но и фильтровать его.",
                "Но доступен и поиск книг по их названию, автору или серии.",
                "Допустим, надо найти книгу \"Гарри Поттер и методы рационального мышления\". В программе реализован полнотекстовый поиск по заголовкам книг, поэтому не обязательно вводить всё название. Достаточно ввести пару-тройку слов, даже не целиком, и даже не в исходном порядке.",
                "Жмём Enter (или иконку лупы слева), и программа переходит в раздел навигации \"Поиск\", в окне книг показывает результаты поиска",
                "На этом можно было бы и закончить, но добавлю:",
                "Поисковые запросы запоминаются в разделе \"Поиск\", здесь их можно выбрать повторно",
                "Добавить поисковый запрос можно в этом же разделе, кнопкой с плюсиком",
                "Ненужный запрос можно удалить кнопкой с крестиком"
            ],
            "x": [
                {
                    "q": "Накопились поисковые запросы. Как их удалить? По одному неудобно",
                    "t": [
                        "Выделить все (Ctrl+A) или только ненужные запросы (мышь + Ctrl или Shift)",
                        "Нажать кнопку удаления на одном из выделенных",
                        "Подтвердить удаление в появившемся диалоге",
                        "То же для списка групп."
                    ]
                }
            ]
        },
        {
            "q": "Можно ли сортировать книги по нескольким колонкам?",
            "t": [
                "Можно. Удерживайте Shift, кликая по заголовкам колонок."
            ]
        },
        {
            "q": "Хочу видеть книги только на одном языке. Или на двух. Можно убрать остальные?",
            "t": [
                "Можно. Через меню Настройки/Фильтры, вызываем диалог настройки фильтров",
                "Переходим на вкладку \"Языки\", помечаем галками в колонке \"Книги отфильтрованы\" те языки, книги на которых не хотим видеть. Взводим галку \"Фильтр включен\", жмём \"Применить\".",
                "Всё, книги на неугодных языках спрятаны. Галками в колонке \"Скрыто\" можно скрывать языки из навигации (левой панели главного окна).",
                "Аналогичным образом можно убрать ненужных авторов, серии, жанры и ключевые слова.",
                "<b>(⊙_⊙) Внимание!</b> Галки независимы - убрав из навигации какой-то элемент, вы продолжите видеть связанные с этим элементом книги из других элементов/разделов навигации. И наоборот, отфильтровав книги по какому-то элементу навигации вы продолжите видеть этот элемент навигации в его разделе, а выбрав его, увидите и отфильтрованные книги (если они не были отфильтрованы по другому элементу)",
                "В диалоге работает поиск/фильтр, а у заголовков колонок с галками есть контекстное меню.",
                "\"Быстрый фильтр\" по языку по прежнему доступен из контекстного меню заголовка колонки языка таблицы книг."
            ]
        },
        {
            "q": "Можно ли физически удалить ненужные мне книги из архивов?",
            "t": [
                "Можно. В программу встроена возможность физической чистки коллекции, с удалением файлов из архива и записей из базы данных. Функция удаления файлов из архива изначально заблокирована, чтобы её разблокировать, нужно в главном меню \"Коллекция\" выбрать пункт \"Разрешить деструктивные операции\". После подтверждения намерения продолжать и согласия с опасностью безвозвратной утраты книг в контекстном меню книг активируется пункт \"Удалить навсегда\". Он же сделает активной галку 7 \"Удалить навсегда\", вместе с файлами книг из архива, <a href=\"#offlink3\">см. ниже</a>.",
                "Выбор пункта меню \"Очистка...\" вызовет окно критериев очистки коллекции.",
                "FLibrary поддерживает следующие критерии:",
                "1. \"Удалённые\" книги. При выборе этого критерия из коллекции будут удалены книги, помеченные в базе данных как удалённые.",
                "2. Дубликаты книг. Программа считает дубликатом одноимённые книги, имеющие хотя бы одного общего автора. При выборе этого критерия такие книги удалятся, кроме одной, добавленной в коллекцию последней. Таким образом, дублями среди прочих окажутся разные издания или разные переводы одной книги. Будьте осторожны.",
                "3. Жанры. Можно отметить нежелательные жанры. У этого критерия есть дополнительная настройка, реализованная радиокнопками:",
                "Полное совпадение. При выборе будут удалены те книги, все жанры которых входят в множество выбранных к удалению.",
                "Частичное совпадение. Будут удалены те книги, у которых хотя бы один жанр выбран к удалению. Очень опасная опция.",
                "4. Языки. Можно отметить нежелательные языки. Следует понимать, что реальный язык текста многих книг не совпадает с указанным как в описании, так и в метаданных fb2.",
                "5. По размеру. При выборе этого критерия будут удалены книги, размер файла которых меньше минимального или больше максимального пределов.",
                "6. По рейтингу. Если библиотечный рейтинг книги ниже указанного и/или рейтинга нет, т.е. книгу пока никто не оценил.",
                "9. Сборники.",
                "После аккуратной расстановки галок нажимаем кнопку 8 \"Анализ коллекции\", непродолжительное время ждём анализа коллекции на соответствие указанным критериям, после чего видим сообщение с результатом.",
                "Это последний шанс передумать и нажать \"Нет\". Но если нажать \"Да\", программа начнёт удаление книг.",
                "<b>(⊙_⊙) ВНИМАНИЕ!</b> Если взведена галка 7, то файлы книг будут физически удалены из архивов, а их записи - из базы данных. Для этого может потребоваться продолжительное время, в зависимости от количества удаляемых книг, мощности компьютера, производительности диска, на котором располагается коллекция, и т.п. Но не очень долго. Если галка 7 не взведена, то книги будут просто скрыты в интерфейсе FLibrary.",
                "По окончанию чистки коллекции имеет смысл деактивировать деструктивные операции."
            ]
        },
        {
            "q": "Как сконвертировать книгу из fb2 в нужный мне формат?",
            "t": [
                "В составе FLibrary нет встроенных конвертеров, но есть возможность прикрутить любой внешний, если он имеет интерфейс командной строки. Например, можно позаимствовать нужный конвертер из состава MyHomeLib, или взять его более современный аналог <a href=\"https://github.com/rupor-github/fb2cng/releases\" target=\"_blank\">тут</a>. Для вызова из FLibrary внешнего конвертера нужно настроить скрипты, по одному на каждый желаемый формат.",
                "В главном меню выбираем Настройки/Скрипты...",
                "В появившемся окне нажимаем \"Добавить скрипт\"",
                "В верхней части окна (\"Скрипты\") появится строка, в неё вбиваем желаемое имя скрипта.",
                "Теперь нужно добавить команды скрипта. Какие именно - зависит от выбранного внешнего конвертера. Типичный набор состоит из двух команд: создать папку и вызвать конвертер. ",
                "Итак, добавляем команды.",
                "Жмём \"Добавить команду\"",
                "В нижней части окна «Настройки команды» отобразятся 4 строки, в первой строке «Тип» (1) из выпадающего меню выбираем «Системная команда»",
                "Во второй строке «Команда» (2) записываем <b>mkdir</b> , т.е. создать папку.",
                "В третьей строке «Аргументы» (3) вводим нужный путь. <b>(⊙_⊙) ВНИМАНИЕ!</b> Слеши должны быть пионерские, т.е. в стиле Windows, т.е. такие - \\ . Каждый аргумент желательно заключать в кавычки. Пример:",
                "\"d:\\books\\epub\"",
                "Сохраняем результат - \"ОК\"",
                "Добавляем команду для запуска конвертера: нажимаем «Добавить команду»",
                "В первой строке «Тип» (1) из выпадающего меню выбираем «Запуск консольного приложения», после чего нажимаем на иконку выбора программы во второй строке «Команда» (2)",
                "* Назначение четвертой строки «Рабочая папка» (4) — см. ниже <a href=\"#offlink4\">«Детали, нюансы»</a>",
                "В появившемся диалоге выбора файла указываем желаемый внешний конвертер:",
                "Добавляем параметры запуска конвертера в строке «Аргументы» (3). Этому конвертеру нужны пути к файлам, исходному и сконвертированному. Вводим",
                "\"%source_file%\" \"d:\\books\\epub\\book.epub\"",
                "Сохраняем результат - \"ОК\"",
                "Сохраняем скрипт",
                "Всё, скрипт готов. Теперь в контекстном меню книг, в подменю \"Экспорт\" есть пункт \"Конвертация в epub\", т.е. название скрипта из п.3",
                "Если его выбрать, в папке d:\\books\\epub появится файл book.epub.",
                "Вероятно, мало кто захочет конвертировать книги каждый раз в один и тот же файл, т.к. хочется, чтобы файлы сохранялись в папки по именам авторов, именовались заголовками книг. Для этого в командах скрипта при указании папок следует использовать макросы. Например, чтобы путь к книге содержал её автора и серию (если есть), а имя файла - номер в серии (если есть) и заголовок книги, в «Аргументы» (3) следует указать такую строку:",
                "\"d:\\books\\epub\\%author%\\[%series%\\[%seq_number%-]]%title%.epub\"",
                "Полный список имеющихся макросов доступен из контекстного меню редактирования Аргументов"
            ],
            "x": [
                {
                    "q": "Лень столько читать, можно быстрее?",
                    "t": [
                        "Можно. Накатите этот ключ реестра, подправив пути:",
                        "Windows Registry Editor Version 5.00",
                        "[HKEY_CURRENT_USER\\SOFTWARE\\HomeCompa\\Flibrary\\Scripts\\a1e61de4-da10-4015-a7c3-91453cd0e215]",
                        "\"Name\"=\"Конвертация в epub\"",
                        "\"Number\"=dword:00000001",
                        "\"Type\"=\"ExportToDevice\"",
                        "[HKEY_CURRENT_USER\\SOFTWARE\\HomeCompa\\Flibrary\\Scripts\\a1e61de4-da10-4015-a7c3-91453cd0e215\\37fe0cd3-35ee-4521-85a9-5b3f00138585]",
                        "\"Command\"=\"D:\\\\programs\\\\converters\\\\FB2ePub\\\\Fb2ePub.exe\"",
                        "\"Arguments\"=\"\\\"%source_file%\\\" \\\"D:/books/%author%/[%series%/[%seq_number%-]]%title%.epub\\\"\"",
                        "\"Number\"=dword:00000002",
                        "\"Type\"=\"LaunchApp\"",
                        "[HKEY_CURRENT_USER\\SOFTWARE\\HomeCompa\\Flibrary\\Scripts\\a1e61de4-da10-4015-a7c3-91453cd0e215\\3b791fea-5942-479d-b7e2-6c3c3f6862cd]",
                        "\"Command\"=\"mkdir\"",
                        "\"Arguments\"=\"\\\"D:/books/%author%/[%series%]\\\"\"",
                        "\"Number\"=dword:00000001",
                        "\"Type\"=\"System\""
                    ],
                    "v": true
                },
                {
                    "q": "Детали, нюансы",
                    "t": [
                        "Следует учитывать специфику некоторых конвертеров — они не могут создавать папки, поэтому перед их запуском необходимо создавать папку через системную команду «mkdir», причем учитывая полный конечный путь (используя макросы). Тогда при добавлении первой и второй команды, строки «Аргументы» будут выглядеть так:",
                        "\"d:\\books\\%author%\\[%series%]\"",
                        "\"%source_file%\" \"d:\\books\\%author%\\[%series%\\[%seq_number%-]]%title%.mobi\"",
                        "Также следует учитывать, что при конвертации книг с одинаковым названием (скажем, когда вы решили загрузить два разных перевода одной книги), конвертер будет перезаписывать следующий файл поверх предыдущего, то есть в папке будет только одна книга. Чтобы этого избежать, следует добавлять макросы дополнительной идентификации. Например:",
                        "\"%source_file%\" \"d:\\books\\epub\\%author%\\[%series%\\[%seq_number%-]]%title%_%db_id%.epub\"",
                        "Некоторые конвертеры в работе требуют дополнительных команд - ключей запуска, а также и использования сторонних файлов настроек. Скрипт FLibrary позволяет прописывать дополнительные команды и/или указывать рабочую папку для дополнительных файлов программы <a href=\"#offlink4\">(cwd)*</a>.",
                        "В частности, конвертер fb2 в lrf (fb2lrf.exe - для преобразования в формат древнего соневского ридера Sony PRS-350 (650, 600...)) требует ключи для входного и выходного файла, а также присоединение дефолтного файла со стилями. Поэтому строка «Аргументы» для этого конвертера будет иметь следующий вид:",
                        "\"-i \"%source_file%\" -o \"d:\\books\\%author%\\[%series%\\[%seq_number%-]]%title%_%db_id%.lrf\" -s \"d:\\Programs\\\\converters\\fb2lrf\\default_styles.sini\"",
                        "или в строку «Аргументы» записываем входной и выходной файл с ключами:",
                        "\"-i \"%source_file%\" -o \"d:\\books\\%author%\\[%series%\\[%seq_number%-]]%title%_%db_id%.lrf\"",
                        "а в строке «Рабочая папка» выбираем папку дефолтного файла со стилями.",
                        "* CWD (Current Workind Directory) - это папка, из которой запущена программа. Эта папка является корнем для относительных путей открываемых программой файлов. Для примера показана работа с конвертером fb2lrf_c.exe, которому требуется файл с конфигом. Если его запустить вручную из его собственной папки или, что то же самое, запустить програмно (из FLibrary), указав его собственную папку в качестве CWD, то файл с конфигом можно указать как -s default_styles.sini. А можно совсем не указывать, т.к. по умолчанию он пытается использовать именно этот файл, и в этом случае ему удастся."
                    ]
                }
            ]
        },
        {
            "q": "Выбрал раздел навигации 'Все книги', как теперь выйти из него?",
            "t": [
                "Перейти по любой ссылке из аннотации к любой книге."
            ]
        },
        {
            "q": "Как узнать, есть ли в раздаче нужная мне книга?",
            "t": [
                "Есть несколько вариантов:"
            ],
            "x": [
                {
                    "q": "с каталогизатором (рекомендуется)",
                    "t": [
                        "Скачиваем индексный файл *.inpx и один из инсталляторов FLibrary, на свой вкус",
                        "Устанавливаем FLibrary",
                        "Создаём коллекцию по индексному файлу с опцией \"Добавлять отсутствующие в архивах книги\"",
                        "Ищем в программе нужную книгу"
                    ]
                },
                {
                    "q": "с файлом содержания",
                    "t": [
                        "Скачиваем файл contents.7z. В архиве текстовые файлы в формате csv, по файлу на язык. Каждая строчка файла описывает одну книгу. Формат: авторы, название, серия (номер в серии), архив, файл. Разделитель - табуляция.",
                        "Этот способ имеет смысл, если вас потом устроит книга без обложки и иллюстраций. Иначе всё равно придётся скачивать и устанавливать каталогизатор."
                    ]
                },
                {
                    "q": "с индексным файлом (для опытных)",
                    "t": [
                        "Скачиваем индексный файл *.inpx. Он - обычный zip-архив, содержащий текстовые файлы *.inp, где каждая строка описывает одну книгу раздачи. Строка суть csv, разделитель - байт с кодом 04. Список полей: ",
                        "AUTHOR; GENRE; TITLE; SERIES; SERNO; FILE; SIZE; LIBID; DEL; EXT; DATE; LANG; LIBRATE; KEYWORDS; YEAR; SOURCELIB",
                        "В файлах можно искать по тексту вашим любимым просмотрщиком текстов. Рекомендую встроенный в Far Manager.",
                        "Этот способ имеет смысл, если вас потом устроит книга без обложки и иллюстраций. Иначе всё равно придётся скачивать и устанавливать каталогизатор."
                    ]
                }
            ]
        },
        {
            "q": "Как добыть нужную книгу без скачивания раздачи целиком?",
            "t": [
                "Узнаём, есть ли в раздаче нужная вам книга, <a href=\"#offlink5\">см.</a> инструкцию выше",
                "Узнаём имя архива, в котором находится книга",
                "Скачиваем этот архив, подкладываем под FLibrary",
                "Извлекаем файл книги",
                "...",
                "PROFIT!!!!",
                "Теперь книгу можно экспортировать из FLibrary."
            ],
            "x": [
                {
                    "q": "Можно даже не скачивать архив",
                    "t": [
                        ", а вместо этого настроить скрипт скачивания нужной книги непосредственно с сайта Флибусты. Дополнительно понадобится какое-нибудь консольное приложение для скачивания файлов из интернета (например curl), его надо скачать и установить. Если у вас обычная версия FLibrary, установленная инсталлятором, то для настройки скрипта можно вкатить"
                    ],
                    "x": [
                        {
                            "q": "вот такой ключ реестра",
                            "t": [
                                "Windows Registry Editor Version 5.00",
                                "[HKEY_CURRENT_USER\\SOFTWARE\\HomeCompa\\Flibrary\\Scripts\\933c6488-b061-44d6-82fa-6257a6144f0f]",
                                "\"Name\"=\"Скачать с Флибусты\"",
                                "\"Number\"=dword:00000001",
                                "\"Type\"=\"ExportToDevice\"",
                                "[HKEY_CURRENT_USER\\SOFTWARE\\HomeCompa\\Flibrary\\Scripts\\933c6488-b061-44d6-82fa-6257a6144f0f\\b2206572-8ef6-4a69-8f97-71bcb151505d]",
                                "\"Command\"=\"mkdir\"",
                                "\"Arguments\"=\"\\\"c:/books/%author%/[%series%]\\\"\"",
                                "\"Number\"=dword:00000001",
                                "\"Type\"=\"System\"",
                                "[HKEY_CURRENT_USER\\SOFTWARE\\HomeCompa\\Flibrary\\Scripts\\933c6488-b061-44d6-82fa-6257a6144f0f\\d27e10fd-3816-41b1-af5b-a9a17043ad12]",
                                "\"Command\"=\"D:\\\\programs\\\\curl\\\\bin\\\\curl.exe\"",
                                "\"Arguments\"=\"-o \\\"c:/books/%author%/[%series%/[%seq_number%-]]%title%.zip\\\" -L \\\"http://x.flibusta.is/b/%lib_id%/download\\\"\"",
                                "\"Number\"=dword:00000002",
                                "\"Type\"=\"LaunchApp\"",
                                "<b>(⊙_⊙) ВНИМАНИЕ!</b> Путь к curl в скрипте должен совпадать с тем, куда вы его установили. Если качаете не curl'ом, а другой программой, то надо изменить параметры командной строки в соответствии с её синтаксисом. Также по вкусу поправьте путь, куда будут скачиваться книги. В предложенном файле реестра это c:/books.",
                                "Если вы предпочитаете портабельную версию FLibrary, то вы, скорее всего, продвинутый пользователь, и легко настроите всё сами. Но если вдруг столкнётесь с затруднениями - спрашивайте, буду рад помочь.",
                                "<b>(⊙_⊙) ВНИМАНИЕ!</b> Сработает только для книг с Флибусты. Вероятно, Либрусек тоже предоставляет такую возможность, но ссылка будет другая. Если знаете какая - сообщите мне, добавим сюда."
                            ]
                        }
                    ]
                },
                {
                    "q": "Можно даже обойтись без сторонних средств",
                    "t": [
                        ", но скрипт настраивать всё равно придётся. Зато теперь без curl'а, и достаточно одной встроенной во FLibrary команды:",
                        "Добавляем скрипт",
                        "Как-нибудь называем его, например \"Скачать с Флибусты\"",
                        "Добавляем команду",
                        "Выбираем из выпадахи тип \"Встроенная команда\"",
                        "Выбираем команду \"Скачать\"",
                        "Задаём параметры команды (куда класть, откуда качать). Для скачивания с Флибусты в папку t:/ftp указываем",
                        "-o \"t:/ftp/%author%/[%series%/[%seq_number%-]]%title%.zip\" \"http://x.flibusta.is/b/%lib_id%/download\"",
                        "В вашем случае указываете какой-нибудь валидный путь, типа C:\\books. Или на ваш вкус, лишь бы диск был в системе и были права на запись. Можно также поменять шаблон пути, в контекстном меню строки ввода аргументов доступно контекстное меню с доступными макросами.",
                        "Сохраняем получившееся",
                        "После этих несложных телодвижений в контекстном меню книг появится пункт меню \"Скачать с Флибусты\", по выбору которого книга будет скачана. Если ваши брэндмауэр и оператор интернета не против, конечно."
                    ]
                }
            ]
        },
        {
            "q": "У меня дома 5 компов и 3 ноута. Мне надо скачивать раздачу и ставить FLibrary на все эти устройства?",
            "t": [
                "Не обязательно. FLibrary предоставляет некоторые сетевые возможности в виде нескольких http-сервисов. Для доступа к ним необходимо запустить имеющийся в составе FLibrary http-сервер. Выбираем пункт меню",
                "В открывшемся диалоге => Жмём Пуск и всё, сервер запущен, можно посмотреть на его работу. Для этого можно ткнуть в ставшие кликабельными надписи.",
                "<b>Веб-интерфейс ReactApp.</b> В браузере откроется сайт, разработанный уважаемым alloroc2. Тут можно искать книги по названию/автору/серии, скачивать их и даже читать прямо там, на сайте. Очень удобно. Интерфейс сайта вполне интуитивен, функциональность постоянно расширяется.",
                "<b>Упрощённый веб-интерфейс.</b> Откроется страничка в браузере, отражающая мои познания в html. Там тоже поиск, навигация по коллекции, скачивание и чтение. Но совершенно без какого либо дизайна, предельный минимализм. Очень на любителя, но мне хватает.",
                "<b>OPDS</b> Откроется страничка в браузере с каким-то JSON'ом. Собственно, по этому адресу надо ходить не браузером, а читалкой с поддержкой протокола OPDS.",
                "При запущенном http-сервере эти адреса доступны с любого устройства, находящегося в одной локальной сети, т.е. на другом компьютере/смартфоне/планшете можно зайти на два варианта веб-интерфейса, а также подключиться читалкой к каталогу OPDS."
            ],
            "x": [
                {
                    "q": "ReactApp. От автора",
                    "t": [
                        "Работать через веб можно в браузере с любого устройства.",
                        "Поиск при вводе текста сразу с разбивкой результатов по названиям, авторам и сериям.",
                        "Просмотр групп книг, заранее отобранных в программе.",
                        "Для выбранной книги статистика + обложка, оглавление с указанием глав и их положения в книге.",
                        "Выбранную книгу можно читать не выходя из веб интерфейса каталогизатора.",
                        "Для удобства чтения переключение в полный экран, а так же прокрутка текста.",
                        "Управление шрифтом и скорость прокрутки горячими клавишами.",
                        "Прогресс чтения запоминается в браузере.",
                        "Открыл вебку, нашел книгу и выпал из реальности.",
                        "© alloroc2"
                    ]
                },
                {
                    "q": "Это только дома будет работать? А через интернет нельзя?",
                    "t": [
                        "Можно, но пробрасывать указанные порты во внешний мир придётся самостоятельно. Я в этом не разбираюсь настолько, что даже не уверен в осмысленности предыдущего предложения. Гуглить \"белый IP\" и \"туннели CloudFlare.com\". Буду благодарен всяким умным словам в личку про это вот всё."
                    ],
                    "x": [
                        {
                            "q": "умные говорят",
                            "t": [
                                "(⊙_⊙)",
                                "Доступ извне я прокинул через nginx - просто добавил поддомен book.ххх.хх, получил для него сертификат и теперь можно ходить по https, а nginx уже перенаправляет во внутренней сети на http.",
                                "© SoloMen",
                                "(⊙_⊙)",
                                "Смог с помощью Tilescale. Что я собсна сделал чтобы пользоваться:",
                                "Скачал сам TileScale (где то на просторах интернета говорят есть его опенсрусь аналог) на тапок и комп;",
                                "Включил их (тапок и комп) в общую сеть с помощью Tilescale;",
                                "Включил в FLibrary по ЧаВо сервер и включил именно адрес который стоит в Tilescale, в моем случае это оказался прикрепленный адрес 100.84.44.127 (те кто будут тоже такой способ пробовать, может оказаться другой адрес, смотрите на сайте в панели управления или в диспетчере задач тыкнув в графу с Tilescale, в графе IPv4-адрес под графиком будет собсна сам адрес который и прикрепляем), для себя конкретно оставил включенным opds режим, его же адрес и вбил в строку для AlReader'а;",
                                "Собсна профит;",
                                "UPD В настройке адреса http-сервера можно указать \"Любой\", тогда сервисы будут доступны через все имеющиеся интерфейсы: localhost, 127.0.0.1, локальный IP-адрес, и т.д.",
                                "© AncientSUS"
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "q": "Что за бардак в раздаче с авторами и сериями?",
            "t": [
                "Это последствия слияния Флибусты и Либрусека в рамках одной раздачи. Действительно, несогласованность именования авторов и серий на Флибусте и Либрусеке - серьёзная проблема. Плюс разные подходы библиотек к разрешению коллизий полных тёзок. Из-за этого некоторые имена здесь могут как \"раздвоится\", так и \"схлопнуться\", в результате чего книги одного автора в раздаче могут быть \"привязаны\" к разным, так и наоборот, книги разных авторов приписаны одному. То же с сериями."
            ],
            "x": [
                {
                    "q": "И что, совсем ничего нельзя сделать?",
                    "t": [
                        "Увы, провести согласование на уровне сетевых библиотек-источников книг для этой раздачи вряд ли удастся. Нам остаётся только вносить точечные правки. Если вы заметили, что какой либо автор или серия \"раздвоились\" или \"схлопнулись\" - сообщите об этом мне. Я внесу локальную правку, и следующее месячное обновление исправит ситуацию."
                    ]
                }
            ]
        },
        {
            "q": "А это ничего, что мой антивирус ругается на раздачу?",
            "t": [
                "Ничего. В настоящее время известно о нескольких причинах срабатывания антивирусов на эту раздачу.",
                "1. Инсталлятор FLibrary_setup.exe. ",
                "Файл генерируется одним из самых популярных средств создания инсталляторов Inno Setup. Можно предположить, что этим же инструментом пользуются и вирусописатели, поэтому сигнатуры Inno Setup регулярно попадают в антивирусные базы. Что с этим делать? Солидные софтверные конторы в аналогичных случаях связываются с вендорами, те подкручивают свои базы, и антивирусы перестают ложнореагировать. Увы, я не солидная контора, в случае с FLibrary остаётся лишь довериться моему честному слову и забить на антивирус. Я так и делаю. Ещё можно использовать msi-инсталлятор или архив с \"портабельной\" версией, на них вирустотал ни разу не ругался.",
                "Или тщательно изучить исходные коды на предмет вредоносности и собирать проект самостоятельно.",
                "2. Книга Олега Михайловича Бойцова \"Защити свой компьютер на 100% от вирусов и хакеров\", файл 166093.fb2 в архиве fb2-166043-168102.7z.",
                "Похоже, некоторым антивирусам не нравятся примеры содержащегося там вредоносного кода. По-моему, это явный перебор и паранойя. Если ваша читалка не пытается интерпретировать и запускать скрипты со страниц книг - беспокоиться не о чем, можно смело добавлять *.fb2 в исключения антивируса.",
                "3. Книга Чадова Тимофея \"Использование ListView в режиме виртуального списка\", файл 170704.fb2 в архиве fb2-168103-172702.7z.",
                "В неё автор вложил исполняемый exe-файл, на который ругался как минимум один вендор с virustotal. Но насколько мне известно, антивирусы пока не пытаются парсить fb2 с целью декодировать бинарные вложения из base64, распаковать полученный архив, проанализировать его содержимое. Если ваша читалка не пытается исследовать бинарные вложения книг, на которые нет ссылок с её страниц, с целью запуска внезапно найденных там программ, то беспокоиться опять не о чем."
            ]
        },
        {
            "q": "Нашёл косяк в программе, что делать?",
            "t": [
                "Убедиться, что косяк имеет место в последнем релизе FLibrary. Особенно это касается опечаток, уйма которых была найдена и исправлена во время написания этих инструкций.",
                "Запостить багрепорт <a href=\"https://github.com/heimdallr/books/issues\" target=\"_blank\">тут></a>, по возможности описав косяк, приложив скриншот, etc",
                "Если нет учётки на гитхабе, а регаться лень, то можно написать мне в личку. Или оставить сообщение в топике. Буду благодарен за любую обратную связь. Но тому, кто запостит на гитхаб багрепорт (или фичереквест, который будет взят в работу), будет предоставлена персональная дорелизная сборка FLibrary. С упоминанием в About."
            ]
        },
        {
            "q": "Обещают быструю работу FLibrary, а по факту тормоза. Наврали?",
            "t": [
                "Как минимум у одного пользователя наблюдались помехи в работе программы со стороны Microsoft Defender'а, что проявлялось в замедлении работы и повышенном потреблении оперативной памяти. Настройка Defender'а помогла.",
                "Попробуйте внести в исключения антивируса",
                "Папку с программой",
                "Папку с базой данных коллекции",
                "Папку с архивами книг",
                "Папку с временными файлами (%TEMP%)"
            ]
        },
        {
            "q": "В меню есть какие-то 'развлечения'. Взвёл все галки, что дальше?",
            "t": [
                "Развлекательный контент показывается взамен пустой аннотации, когда в окне книг не выбрано ни одной книги."
            ],
            "x": [
                {
                    "q": "Например",
                    "t": [
                        " "
                    ]
                },
                {
                    "q": "Вижу пустую аннотацию, где шутки?",
                    "t": [
                        "Чтобы это работало, нужен доступ а) к интернету, б) к сервисам, предоставляющим контент. Следует учитывать, что какие-то сервисы могут перестать работать. А к некоторым нет доступа из вашей локации без впн.",
                        "В целях диагностики проблемы можно скрытой настройкой включить показ ошибок получения развлекательного контента."
                    ]
                },
                {
                    "q": "Почему всё на английском?",
                    "t": [
                        "Если найдёте (или поднимите свой) подобный публичный (без регистрации и смс) сервис на другом языке - дайте мне знать, прикручу."
                    ]
                }
            ]
        },
        {
            "q": "Зачем в раздаче столько инсталляторов FLibrary?",
            "t": [
                "Three Rings for the Elven-kings under the sky",
                "Seven for the Dwarf-lords in their halls of stone",
                "Nine for Mortal Men doomed to die"
            ],
            "x": [
                {
                    "q": "I FLibrary_setup.exe",
                    "t": [
                        "Генерируется InnoSetup. Основной инсталлятор, наиболее удобный и функциональный. Позволяет",
                        "Выбрать язык инсталлятора",
                        "Выбрать режим установки только для меня/для всех",
                        "Запустить прогу сразу после установки",
                        "Есть ньюанс: его не любят некоторые антивирусы. Кому верить, антивирусу или нам с Jordan Russell и Martijn Laan - решайте сами..."
                    ]
                },
                {
                    "q": "II FLibrary_setup.msi",
                    "t": [
                        "Microsoft Windows Installer. Скорее всего, я просто не умею его готовить, но",
                        "Язык инсталлятора один и для универсальности английский",
                        "Программа устанавливается только для всех, в `C:\\Program Files`",
                        "После завершения работы инсталлятора автоматически ничего не запускается",
                        "Буду рад, если меня научат, как сделать msi гладким и шелковистым."
                    ]
                },
                {
                    "q": "III FLibrary_portable.7z",
                    "t": [
                        "Это вообще не инсталлятор, а просто архив с бинарями. Распаковывать и настраивать ярлыки запуска придётся самостоятельно, ручками. Установленная таким образом программа свои настройки хранит не в реестре, а в лежащем рядом ini-файле, типа portable. Следовательно, распаковывать надо туда, где есть доступ на запись."
                    ]
                },
                {
                    "q": "Да <s>куда</s> какой ставить-то?",
                    "t": [
                        "Содержимое всех инсталляторов идентично, можно ставить любой, на свой вкус и опыт. Но рекомендую первый вариант, поскольку сам использую именно его. Остальные два не тестируются почти никогда."
                    ]
                }
            ]
        },
        {
            "q": "А где программа хранит ...?",
            "t": [
                " "
            ],
            "x": [
                {
                    "q": "настройки",
                    "t": [
                        "Обычная версия (установленная инсталлятором) - ветка реестра HKEY_CURRENT_USER\\SOFTWARE\\HomeCompa\\Flibrary",
                        "Портабельная версия (из архива) - файл FLibrary.ini в папке программы"
                    ]
                },
                {
                    "q": "журнал работы (логи)",
                    "t": [
                        "Файл %TEMP%\\HomeCompa.FLibrary.log",
                        "Последние записи лога можно увидеть прямо в программе, нажав Esc. Или через меню Настройки/Вид/Журнал/Показать."
                    ]
                }
            ]
        },
        {
            "q": "А можно полный список скрытых настроек FLibrary?",
            "t": [
                "Тут описаны мало кому нужные вещи, поэтому их нет в интерфейсе, дабы не загромождать.",
                "<b>(⊙_⊙) ВНИМАНИЕ!!!</b> Настройки эти следует добавлять по мере необходимости, по умолчанию в хранилище настроек их нет.",
                "Где искать настройки - см. <a href=\"#offlink2\">\"А где программа хранит ...?\".</a>",
                "v2.0.0 `Preferences/LibRate/symbol`, число по умолчанию 11088 - ascii или utf-8 код символа звёздочки ⭐ для колонки рейтинга в библиотеке-источнике. Коды разных символов можно посмотреть <a href=\"https://www.w3schools.com/charsets\" target=\"_blank\">тут</a>. Можно использовать те, что имеют в Hex не более четырёх знаков.",
                "v2.1.2 `Preferences/hideScrollBars`, строка (true | false) по умолчанию true - управляет видимостью скроллбаров. Если задать 'false'. скроллбары не будут прятаться.",
                "v2.1.4 `Preferences/GenresSortMode`, строка (SortByCode | SortByName | SortByChildCount | SortByCodeDesc | SortByNameDesc | SortByChildCountDesc), по умолчанию SortByCode - режим сортировки жанров",
                "v2.1.4 `Preferences/opds/BookEntryLimit`, число DWORD, по умолчанию 25 - лимит на количество книг, отдаваемое одним списком по http.",
                "v2.2.0 Не настройка, но скрытая функциональность. Сочетание Alt+Shift+Q вызовет окно, в котором можно выполнять SQL-запросы к базе данных коллекции. Результаты выполнения запросов - в логах.",
                "v2.2.1 `Preferences/opds/transliterate`, строка (true | false) по умолчанию false - транслитерация имени файла, скачанного по http.",
                "v2.2.1 `Preferences/LibRate/precision`, число DWORD, по умолчанию -1 - заменяет звёздочки рейтинга книги в библиотеке на число с указанной этим параметром точностью. Для действительно среднего рейтинга по Флибусте потребуется файл reviews\\additional.zip. При отсутствии этой настройки или при её значении -1 показываются звёздочки.",
                "v2.2.1 `Preferences/LibRate/colors/2.0`, `ui/Books/LibRate/colors/3.0`, `ui/Books/LibRate/colors/4.5`и т.п. Число DWORD, соответствующее цвету в формате RRGGBB. Для градиентной раскраски цифер рейтинга из предыдущего пункта.",
                "v2.2.2 `Preferences/AnnotationJokes/Visible`, строка (true | false) по умолчанию true - при установке в 'false' отключает функциональность развлекательного контента в пустой аннотации.",
                "v2.2.2 `Preferences/AnnotationJokes/%ApiName%Visible`, строка (true | false) по умолчанию true - при установке в 'false' отключает работу %ApiName%, прячет соответствующий пункт меню `Настройки/Вид/Аннотация/Развлечения/%ApiNameTitle%`. Имеет смысл отключить те API, которые недоступны в вашей местности. Или переставшие работать.",
                "v2.3.0 `Preferences/opds/ReadUrlTemplate` Шаблон ссылки на читалку из Web. Например, если установить в `http://127.0.0.1:44080/#/reader?url=http://%HTTP_HOST%:%HTTP_PORT%/Images/fb2/%1` то можно читать книжки либерамой. Перед этим либераму надо <a  href=\"https://github.com/bookpauk/liberama\" target=\"_blank\">скачать</a>, настроить и запустить. Возможно, настройке когда-нибудь найдётся и другое применение.",
                "v2.3.0 `Preferences/opds/SeparatedSearch`, строка (true | false) по умолчанию false - для OPDS и Web-интерфейса включает режим раздельного поиска по авторам, сериям, названиям книг, всё вместе.",
                "v2.3.0 `Preferences/opds/AutoupdateCollection`, строка (true | false) по умолчанию false - при установке в `true` http-сервер (opds.exe) будет следить за inpx и, в случае его изменения, автоматически обновит коллекцию.",
                "v2.4.1 `Preferences/StartFocusedControl`, строка (SearchBooksByNames | NavigationSearchAndFilter | BooksSearchAndFilter) по умолчанию SearchBooksByNames - поле ввода, активное на старте программы.",
                "v2.4.1 `Preferences/Alphabets/LinkedControl`, строка (SearchBooksByNames | NavigationSearchAndFilter | BooksSearchAndFilter) - поле ввода, с которым работает панель алфавитов. По умолчанию - не указано, панель алфавитов работает с активным полем ввода, т.е. с тем, в котором сейчас находится курсор.",
                "v2.4.1 `Preferences/CommonBooksTableColumnSettings`, строка (true | false) по умолчанию false - при установке в `true` настройка столбцов таблицы книг станет общей для всех режимов навигации.",
                "v2.5.0 `Preferences/AnnotationReviewSortMode`, строка (Time | Reviewer | Text | TimeDesc | ReviewerDesc | TextDesc), по умолчанию Time - режимы сортировки отзывов читателей в аннотации.",
                "v2.5.4 `Preferences/HideToTray`, строка (true | false) по умолчанию false - при установке в `true` программа по Alt+F4 и по нажатию на крестик в главном окне прячется в системный трей. Выход через главное меню и по горячей клавише закрывает программу.",
                "v2.5.4 `Preferences/MultipleInstance`, строка (Enabled | Disabled | Dialog) - настраивает возможность запуска нескольких экземпляров FLibrary. Enabled - можно запустить несколько экземпляров, Disabled - нельзя, при запуске следующего экземпляра приложения будет показан уже имеющийся, Dialog - при запуске следующего экземпляра будет показан диалог. По умолчанию - Enabled. Но если установлен режим HideToTray (см. выше), то всегда Disabled, вне зависимости от установленного значения настройки.",
                "v2.5.4 `Preferences/Export/TransliterationMode, строка (None | FileNameOnly | AllExceptUserPath | All) - настраивает транслитерацию имени экспортируемых файлов. По умолчанию - None, т.е. не транслитерировать. FileNameOnly - будет транслитерировано имя файла, AllExceptUserPath - транслитерировать путь экспорта кроме выбранной пользователем папки (%user_destination_folder%), All - транслитерировать весь путь экспорта.",
                "v2.5.4 `Preferences/Interaction/Book/OnLink`, строка (Read | ExtractAsFb2 | ExtractAsZip) - настраивает поведение программы по клику на ссылку-заголовок книги в аннотации. По умолчанию - Read - открыть книгу в читалке. ExtractAsIs - извлечь книгу. ExtractAsZip - извлечь книгу и упаковать её в zip-архив.",
                "v2.5.4 `Preferences/Interaction/Book/OnDoubleClick`, строка (Read | ExtractAsFb2 | ExtractAsZip) - настраивает поведение программы по двойному клику на строке в таблице книг, значения те же, что в предыдущей настройке.",
                "v2.5.4 `Preferences/RelativePaths', строка  (true | false) по умолчанию false - при установке в `true` программа будет сохранять в настройках относительные пути (читалка, скрипты, ...)",
                "v2.5.5 `Preferences/ReadMark/color' - цвет метки прочитанных книг - число DWORD, соответствующее цвету в формате AABBGGRR, где АА - это значение прозрачности, а BBGGRR - значения для каждого из цветов RGB (! Обратите внимание на последовательность цветов => B-G-R !). Также стоит учитывать, что AA - инвертировано, т.е. при значении прозрачности FF (непрозрачно 100%) - цвет станет полностью прозрачным и виден не будет. Установка цвета не обязательна для применения, для выделения прочитанного можно вообще не указывать параметр 'color', а только параметр 'width', в таком случае цветом метки будет использован цвет текста (т.е. в светлой теме - черный, в темной - белый). <b>(⊙_⊙)</b> Книга становится \"прочитанной\" при установке для неё пользовательского рейтинга.",
                "v2.5.5 `Preferences/ReadMark/width', число DWORD, по умолчанию `0` - ширина метки прочитанных книг. Значение '0' отключает пометку. ",
                "v2.5.5 `Preferences/opds/converter', раздел для управления конвертацией файлов, скачиваемых по http (opds, web-интерфейсы). Ключи:",
                "command, строка - путь к исполняемому файлу (утилите командной строки) конвертера",
                "arguments, строка - параметры конвертера, по умолчанию \"%src%\" \"%dst%\". Используются следующие подстановки (макросы): %src% - конвертируемый .fb2-файл книги, %dst% - файл-результат",
                "cwd, строка - рабочая директория для запускаемого конвертера, по умолчанию - папка с FLibrary.exe",
                "ext, строка - расширение файла после конвертации ",
                "<b>(⊙_⊙) ВНИМАНИЕ!</b> На web перестанет работать чтение. Если кому-то актуально - сообщите, пожалуйста.",
                "v2.5.5 `Preferences/AnnotationJokes/ShowErrors`, строка  (true | false) по умолчанию `false` - при установке в `true` в случае ошибки получения развлекательного контента будет показываться её текст.",
                "v2.5.5 `Preferences/Books/Alignment', раздел для управления выравниванием полей в таблице книг. В этом разделе можно заводить ключи с именем поля и значением выравнивания. Возможные имена полей (ключей): Author, Title, Series, SeqNumber, Genre, Folder, FileName, Size, LibRate, UserRate, UpdateDate, Year, Lang. Возможные значения выравнивания: AlignLeft, AlignRight, AlignCenter. Если интересно, можно поэкспериментировать с значениями <a href=\"https://doc.qt.io/qt-6/qt.html#AlignmentFlag-enum\" target=\"_blank\">отсюда</a>",
                "v2.5.5 `Preferences/UserRate/symbol`, число по умолчанию '11088' - ascii или utf-8 код символа звёздочки ⭐ для колонки пользовательского рейтинга.",
                "v2.5.5 `Preferences/UserRate/noRateSymbol`, ascii или utf-8 код символа для книг с рейтингом \"Без оценки\".",
                "v2.5.6 `Preferences/Books/ContextMenu/HashEnabled`, строка  (true | false) по умолчанию false - при установке в `true` добавляет в контекстное меню книг подменю \"Хэш\" с элементами \"Вычисление\" и \"Сравнение\". Для интересующихся детектором дублей."
            ],
            "x": [
                {
                    "q": "Прочитал ЧаВо о скрытых настройках. \"Ничего не понял, но было интересно ©\"",
                    "t": [
                        "Странно, до вас никто не жаловался. Что ж, давайте разжую. Вы захотели заменить символ звездочки..."
                    ],
                    "x": [
                        {
                            "q": "Если у вас портабельная версия FLibrary, то:",
                            "t": [
                                "Закройте FLibrary",
                                "Откройте в текстовом редакторе файл FLibrary.ini из папки программы",
                                "Найдите в нём раздел [Preferences] и добавьте в него строку `LibRate\\symbol=9734`",
                                "Сохраните файл",
                                "Запустите FLibrary",
                                " * Вместо числа 9734 подберите своё по вкусу, например <a href=\"https://www.w3schools.com/charsets/ref_utf_symbols.asp\" target=\"_blank\"><b>отсюда</b></a>"
                            ]
                        },
                        {
                            "q": "Если ваша версия FLibrary установлена инсталлятором, то:",
                            "t": [
                                "Закройте FLibrary",
                                "Запустите редактор реестра",
                                "Перейдите к ветке `HKEY_CURRENT_USER\\Software\\HomeCompa\\FLibrary\\Preferences`",
                                "Создайте (если его там нет) в этой ветке подраздел `LibRate`",
                                "Создайте в этом подразделе DWORD параметр `symbol`",
                                "Задайте параметру десятичное значение 9734 (оно же шестнадцатеричное 2606)",
                                "Запустите FLibrary",
                                " * Вместо числа 9734 подберите своё по вкусу, например <a href=\"https://www.w3schools.com/charsets/ref_utf_symbols.asp\" target=\"_blank\"><b>отсюда</b></a>"
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}
